"""
Начальник дал джуну Ване реализовать анонимную функцию, которая принимает два числа,
возводит каждое в квадрат и складывает полученные результаты.
Сохранить функцию необходимо было в переменную square

Но Ваня очень разволновался и допустил несколько ошибок.

Вам, как опытному коллеге, необходимо исправить ошибки Вани, чтобы начальник не лишил его зарплаты.
Исправления нужно сделать только в пределах одной строки.

Вводить и выводить ничего не нужно
"""

square = lambda x, y: x ** 2 + y ** 2
