"""
Представьте, что мы с вами сами можем решать кому и сколько статуэток Оскара уйдет
(Лео бы тогда давно купался в этих статуэтках).

Ваша задача написать функцию print_best_and_worst_laureate, которая находит информацию,
кто из номинантов получил наибольшее и наименьшее количество статуэток.
Функция print_best_and_worst_laureate принимает на вход словарь,
где указана номинация и имя победителя в ней (название фильма или имя актера).
На основании этой информации функция print_best_and_worst_laureate должна в отдельных строках вывести лауреатов премии,
набравших наибольшее и наименьшее количество статуэток и через запятую их количество.
"""

