"""
Перед вами список словарей foods, который хранит в себе информацию о меню ресторана.
Проанализируйте ключи и значения, хранящиеся в словарях списка foods,
они вам потребуются для задания.

Ваша задача — найти все имена блюд, которые являются  салатами в списке foods.
Из имен салатов необходимо составить список, элементы которого должны следовать в том же порядке,
как и в списке foods.

В качестве ответа выведите на экран найденный список.

Используйте функции map и filter.
"""

foods = [
    {'name': "Стейк Рибай", 'type_food': "Основное", 'price': 75.95},
    {'name': "Ассорти из гигантских креветок", 'type_food': "Закуска", 'price': 2029.95},
    {'name': "Оливье", 'type_food': "Салат", 'price': 329.95},
    {'name': "Жареный канадский бекон", 'type_food': "Закуска", 'price': 239.95},
    {'name': "Крабовый пирог", 'type_food': "Закуска", 'price': 532.95},
    {'name': "Цезарь", 'type_food': "Салат", 'price': 14.95},
    {'name': "Пирог из лобстера", 'type_food': "Закуска", 'price': 230.95},
    {'name': "Огурчики", 'type_food': "Закуска", 'price': 123.95},
    {'name': "Мимоза", 'type_food': "Салат", 'price': 223.95},
    {'name': "Овощной", 'type_food': "Салат", 'price': 310.95},
    {'name': "Картошка фри", 'type_food': "Гарнир", 'price': 234.95},
    {'name': "Спаржа", 'type_food': "Гарнир", 'price': 455.95},
    {'name': "Стейк Техасский", 'type_food': "Основное", 'price': 1631.95},
    {'name': "Грибы", 'type_food': "Гарнир", 'price': 234.95},
    {'name': "Лосось на гриле", 'type_food': "Основное", 'price': 936.95},
    {'name': "Крабовый", 'type_food': "Салат", 'price': 563.95}
]

salads = list(map(lambda dish: dish["name"], filter(lambda dish: dish.get("type_food") == "Салат", foods)))

print(salads)
