""" 
Функция range - 3
Теперь ваша задача создать полную копию встроенного объекта range. 
Он может быть вызван от одного, двух или трех аргументов.

Если вызов происходит от одного аргумента n, 
то my_range_gen  генерирует все числа от 0 до n не включительно.
 
Если вызов происходит от двух аргументов a и b, 
то my_range_gen  генерирует все числа от a включительно до b не включительно.
 
Если вызов происходит от трех аргументов a , b и step, 
то my_range_gen  генерирует все числа от a включительно до b не включительно 
c шагом step( может быть отрицательное значение).
"""

